/*****************************************************************************
 * ??相???
 * Author: Dong Xiaoguang
 * Created on 2017/06/15
 *****************************************************************************/
#ifndef MEMSIC_CUSTOM_SPEC_H_INCLUDED
#define MEMSIC_CUSTOM_SPEC_H_INCLUDED

//-----------------------------------------------------------------------------
float ts0 = 0.02f;//采?周期

//-----------------------------------------------------------------------------
//offset and radius
float iniCalPara[4] = {0,0,0,0};

//-----------------------------------------------------------------------------
//defaul accuracy
int iniAccuracy = 0;

//-----------------------------------------------------------------------------
//soft iron calibration parameters
float si[3][3] = {{1.0,0.0,0.0},
                    {0.0,1.0,0.0},
                    {0.0,0.0,1.0}};

//magnetometer noise parameters 					
float magVar[3] = {0.03,0.03,0.03};// 磁??, uT^2
//-----------------------------------------------------------------------------
//gyroscope parometers
int enableGyroCal = 1 ;          //陀螺是否需要校准常偏
int outlierGyroRestart = 3;     //算法重?后，陀螺的野??量，需要?掉
float iniGyroBias[3] = {1e-5,1e-5,1e-5};//初始陀螺常偏，rad/s
//float iniGyroBias[3] = {0.0593,0.0999,0.0778};//初始陀螺常偏，rad/s
int gyroGrade = 5000;              //陀螺指?，0表示精度差，??越大，代表陀螺性能越好，最大不超?5000

//-----------------------------------------------------------------------------
//calibration parameters
int extraSampleCount[3] = {0,0,0};//手??整校准精度分?到1、2和3所需的点?，?整量不超?5?点

#endif // MEMSIC_CUSTOM_SPEC_H_INCLUDED
